# Defining the basic <u>CRUD</u> (Create,  Read, Update, Delete) Operations on Pandas Dataframes

Import the modules

In [1]:
import pandas as pd

# <u>Create</u> :

We'll create a dataframe of pokemons using a dictionary and insert a number of inputs to get the idea

Define the columns first in a list representing the specs

In [2]:
cols = ['Name','Type','HP','Attack','Defense']

In [3]:
df = pd.DataFrame(columns=cols)

In [4]:
df

Empty DataFrame
Columns: [Name, Type, HP, Attack, Defense]
Index: []

In [5]:
df.shape[1]

5

# <u>Adding a Row</u>

### Adding a row : ( with "loc")

We are going to add our first Pokemon

In [6]:
df.loc[1] = ['Bulbasaur','Grass',45,49,49]

### Adding a row with "append()" : (dict version)

In [7]:
charmander = {'Name':'Charmander','Type':'Fire','HP':39,'Attack':52,'Defense':43}
df = df.append(charmander,ignore_index=True)
df

         Name   Type  HP Attack Defense
0   Bulbasaur  Grass  45     49      49
1  Charmander   Fire  39     52      43

### Adding a row with "append()" : (Series version )

In [8]:
squirtle = ['Squirtle','Water',44,48,65]
df = df.append(pd.Series(squirtle,index=df.columns),ignore_index=True)
df

         Name   Type  HP Attack Defense
0   Bulbasaur  Grass  45     49      49
1  Charmander   Fire  39     52      43
2    Squirtle  Water  44     48      65

### Adding rows as a list of series :

In [9]:
caterpie = pd.Series(['Caterpie','Bug',45,30,35],index=df.columns)
weedle = pd.Series(['Weedle','Bug',40,35,30],index=df.columns)
pidgey = pd.Series(['Pidgey','Flying',40,45,40],index=df.columns)

lseries = [caterpie,weedle,pidgey]

In [10]:
df = df.append(lseries,ignore_index=True)
df

         Name    Type  HP Attack Defense
0   Bulbasaur   Grass  45     49      49
1  Charmander    Fire  39     52      43
2    Squirtle   Water  44     48      65
3    Caterpie     Bug  45     30      35
4      Weedle     Bug  40     35      30
5      Pidgey  Flying  40     45      40

# <u>Adding a Column : </u>

### Adding a column with "assign()" :

We gonna assign Speed to each pokemon

In [11]:
df = df.assign(Speed=[45,65,43,45,50,56])
df

         Name    Type  HP Attack Defense  Speed
0   Bulbasaur   Grass  45     49      49     45
1  Charmander    Fire  39     52      43     65
2    Squirtle   Water  44     48      65     43
3    Caterpie     Bug  45     30      35     45
4      Weedle     Bug  40     35      30     50
5      Pidgey  Flying  40     45      40     56

### Adding a column with a default value :

We want to know if a pokemon is legendary or not but adding a new spec 'Legendary' that consists in a boolean variable

In [12]:
df['Legendary'] = 'False'

In [13]:
df

         Name    Type  HP Attack Defense  Speed Legendary
0   Bulbasaur   Grass  45     49      49     45     False
1  Charmander    Fire  39     52      43     65     False
2    Squirtle   Water  44     48      65     43     False
3    Caterpie     Bug  45     30      35     45     False
4      Weedle     Bug  40     35      30     50     False
5      Pidgey  Flying  40     45      40     56     False

Will give the same input to all the rows

# <u>Delete Rows : </u>

### Deleting with "drop()"

We gonna drop out one of the insect pokemon (Yikes)

In [14]:
#Dropping with the index number. without saving the changes
df.drop(4)

         Name    Type  HP Attack Defense  Speed Legendary
0   Bulbasaur   Grass  45     49      49     45     False
1  Charmander    Fire  39     52      43     65     False
2    Squirtle   Water  44     48      65     43     False
3    Caterpie     Bug  45     30      35     45     False
5      Pidgey  Flying  40     45      40     56     False

### Deleting  multiple rows

In [15]:
df.drop([3,4])

         Name    Type  HP Attack Defense  Speed Legendary
0   Bulbasaur   Grass  45     49      49     45     False
1  Charmander    Fire  39     52      43     65     False
2    Squirtle   Water  44     48      65     43     False
5      Pidgey  Flying  40     45      40     56     False

# <u>Delete Columns : </u>

### Deleting columns with "drop()":

In [16]:
df

         Name    Type  HP Attack Defense  Speed Legendary
0   Bulbasaur   Grass  45     49      49     45     False
1  Charmander    Fire  39     52      43     65     False
2    Squirtle   Water  44     48      65     43     False
3    Caterpie     Bug  45     30      35     45     False
4      Weedle     Bug  40     35      30     50     False
5      Pidgey  Flying  40     45      40     56     False

Deleting the "Legendary column"

In [17]:
#axis = 0 : index
#axis = 1 : columns
df.drop('Legendary',axis=1)

         Name    Type  HP Attack Defense  Speed
0   Bulbasaur   Grass  45     49      49     45
1  Charmander    Fire  39     52      43     65
2    Squirtle   Water  44     48      65     43
3    Caterpie     Bug  45     30      35     45
4      Weedle     Bug  40     35      30     50
5      Pidgey  Flying  40     45      40     56

### Deleting multiple columns

In [18]:
df.drop(['Type','Legendary'],axis='columns')

         Name  HP Attack Defense  Speed
0   Bulbasaur  45     49      49     45
1  Charmander  39     52      43     65
2    Squirtle  44     48      65     43
3    Caterpie  45     30      35     45
4      Weedle  40     35      30     50
5      Pidgey  40     45      40     56

### Delete columns by index position

In [19]:
df.drop([df.columns[1],df.columns[6]],axis=1)

         Name  HP Attack Defense  Speed
0   Bulbasaur  45     49      49     45
1  Charmander  39     52      43     65
2    Squirtle  44     48      65     43
3    Caterpie  45     30      35     45
4      Weedle  40     35      30     50
5      Pidgey  40     45      40     56

# <u>Change Column Name : </u>

In [20]:
col_names = df.columns.values
col_names

array(['Name', 'Type', 'HP', 'Attack', 'Defense', 'Speed', 'Legendary'], dtype=object)

In [21]:
col_names[6] = 'Mythic'

In [22]:
df

         Name    Type  HP Attack Defense  Speed Mythic
0   Bulbasaur   Grass  45     49      49     45  False
1  Charmander    Fire  39     52      43     65  False
2    Squirtle   Water  44     48      65     43  False
3    Caterpie     Bug  45     30      35     45  False
4      Weedle     Bug  40     35      30     50  False
5      Pidgey  Flying  40     45      40     56  False